{
  "assetId": "289577",
  "title": "Galaxy Pack - Planets",
  "slug": "galaxy-pack-planets",
  "shortDescription": "Transform your Unity projects with the Planetary Exploration Pack, featuring diverse and detailed planet designs",
  "description": "Transform your Unity projects with the Planetary Exploration Pack, featuring diverse and detailed planet designs. Perfect for space-themed games.Transform your Unity projects with the Planetary Exploration Pack, an essential asset pack featuring diverse and detailed planet designs. Perfect for space-themed games, this pack provides everything you need to create immersive and visually stunning interstellar environments.Dive into a universe of possibilities with a wide range of planet designs, from vibrant, life-sustaining worlds to mysterious, barren moons. Each planet is meticulously crafted for a visually captivating experience, enhancing your space exploration game.Optimized for Unity, these planets assets ensure seamless integration and smooth performance across various platforms. Whether you're targeting mobile devices or desktop computers, these planets provide the foundation for immersive and engaging gameplay experiences.Perfect for space exploration, sci-fi RPGs, and strategy games, the Planetary Exploration Pack offers versatile assets for endless creative possibilities. Craft a unique universe and elevate your Unity projects with stunning space scenes and immersive gameplay.Explore the final frontier with the Planetary Exploration Pack – bringing the beauty and mystery of the cosmos to life in your Unity games.🪐 Key Features 🪐Prefabs are ready to be used out of the box, simply drag and drop them into your scene!1 Shader for all 3D props.Includes one asset overview scene.Compatible with ALL rendering pipelinesThis Package Includes:HDRP, Standard & URP support.88 Prefabs84 Textures (2048x2048) including Base Color, Normal Map, Mask and Emission1 Shader for Models/Environments optimized for mobileAverage Polycount: 996 tris",
  "price": 15,
  "points": 200,
  "compareAtPrice": null,
  "available": "N/A",
  "rating": null,
  "thumbnail": "https://assetstorev1-prd-cdn.unity3d.com/key-image/7cb70970-5555-493d-92d5-76ebe5209b81.jpg",
  "category": "props",
  "publisher": {
    "name": "Piloto Studio",
    "url": "https://assetstore.unity.com/publishers/48767",
    "slug": "piloto-studio"
  },
  "productUrl": "https://assetstore.unity.com/packages/package/289577",
  "sourceFile": "Galaxy Pack - Planets.unitypackage",
  "status": "draft",
  "visibility": "public",
  "createdAt": "2025-10-01T17:50:21.046Z",
  "updatedAt": "2025-10-01T22:27:50.615Z",
  "searchQuery": "Galaxy Pack Planets",
  "matchConfidence": 1
}