{
  "assetId": "282274",
  "title": "GLAMOR Advanced Image Effects",
  "slug": "glamor-advanced-image-effects",
  "shortDescription": "GLAMOR is an image effects framework for URP that allows for layer selective application of screen space effects and includes a big library of advanced and image enhancing effects.IMPORTANT: GLAMOR v2.0.0 for Unity 6 LTS is not compatible with the previous Unity 6 v1.x versions or Unity 2022.3 version",
  "description": "GLAMOR is an image effects framework for URP that allows for layer selective application of screen space effects and includes a big library of advanced and image enhancing effects.IMPORTANT: GLAMOR v2.0.0 for Unity 6 LTS is not compatible with the previous Unity 6 v1.x versions or Unity 2022.3 version. Please remove completly the previous version or use the new v2.0.0 in a new project.GLAMOR is an image effects framework for URP that allows for layer selective application of screen space effects and includes a big library of advanced and image enhancing effects.IMPORTANT: The new GLAMOR version 2.0.0 for Unity 6 LTS of the system is not compatible with the previous Unity 6 v1.x versions or Unity 2022.3 version. Please remove completly the previous version before installation of v2.0.0 or use in a new project.IMPORTANT: To use GLAMOR version 2.0.0 with ODIN inspector, if get an issue with Volume FX entries in VFX renderer feature, open Odin preference Settings, go to editor types, uncheck the Script Types -> Artngame folder and click \"update editors\", then it won't update any of the inspector elements in that folder with the Odin counterparts and will be able to use the GLAMOR system normally. Video for refererence.This is the first version of the system and is planned to be augmented with numerous extra effects and enhancements to the current effects as the development progresses. Please provide any feedback for enhancements on the system in  ARTnGAME Discord Channel.The system is compatible with Windows and Unity 2023.3 to Unity 6 URP, also supports the new URP Render Graph mode, all under a single framework.---------------------------------------------------------------------------------BIG OFFER:Upgrade to the Environment Building Bundle from GLAMOR for only $99 for a limited time (vs $460 full price)!---------------------------------------------------------------------------------GLAMOR DEMO (Desktop Windows)GLAMOR Video TutorialsIMPORTANT: The system requires Unity 2022.3.18 and above with URP renderer. Due to the complexity and technical methods, officially supports only LTS versions and has been tested in Unity 2022, 2023 and Unity 6. The system does not officially support VR, Mobile, Mac, WebGL, OpenGL and Consoles and has not yet been tested on those platforms. Also non LTS Unity versions are not officially supported.More info on the official ARTnGAME Website and GLAMOR Forum Thread.For direct chat and help on any issue, please contact me via ARTnGAME Discord Channel or ARTnGAME support [E-mail].A version for BiRP is available as a Google Drive download bonus for users of this main URP system. Note the BiRP is a rather different approach, not using layer selective advanced method and rather it is a big collection of image effects, many of which were the base of the URP effects in GLAMOR.GLAMOR Image Effects framework featuresMain features:- Layer selective application of effects- Volume selective application and control of effects, with local or global application- Image effects stack, with possibility to get different results by reordering the effects priority.- Large collection of effects, to be constantly enhanced and augmented with new effectsImage effects:- Screen space sun shafts- Volumetric Fog with Impostor volume lights module- Screen space rain applied in scene objects using depth and normals information- Screen rain for camera front rain drips- Cloud shadows- Painterly effects, including Kawahara effect- Eye adaptation auto exposure system- Sharpen filter- Blur filter- Vhs and old movie emulation effects- Sketch effect and general screen space texture stable application- Bloomy Haze effect- Color adjustments- Bloom filter- Pixelation filter- Ascii effect- Lens Flare Effect- Pencil effect (Added in v1.1)- Watercolor effect (Added in v1.2)- Lens Light Streaks  (Added in v1.2)- Advanced Lens Effects - Streaks, Bloom & Lens Dirt (Added in v1.3)- Duo Tone standalone effect (Added in v1.7) (Video 1)(Video 2)Extra effects coming soon:- Adaptive Sharpen- Analog Glitch- Contour- Cartoonify- Edge detection- Oil paintingIMPORTANT: To use GLAMOR version 2.0.0 with ODIN inspector, if get an issue with Volume FX entries in VFX renderer feature, open Odin preference Settings, go to editor types, uncheck the Script Types -> Artngame folder and click \"update editors\", then it won't update any of the inspector elements in that folder with the Odin counterparts and will be able to use the GLAMOR system normally. Video for refererence.",
  "price": 50,
  "points": 200,
  "compareAtPrice": null,
  "available": "N/A",
  "rating": 4.9,
  "thumbnail": "https://assetstorev1-prd-cdn.unity3d.com/key-image/f5b81fbd-7583-4862-b0b6-2fa082fb7636.jpg",
  "category": "particles-amp-effects",
  "publisher": {
    "name": "ARTnGAME",
    "url": "https://assetstore.unity.com/publishers/6503",
    "slug": "artngame"
  },
  "productUrl": "https://assetstore.unity.com/packages/package/282274",
  "sourceFile": "GLAMOR Advanced Image Effects.unitypackage",
  "status": "draft",
  "visibility": "public",
  "createdAt": "2025-10-01T17:50:20.950Z",
  "updatedAt": "2025-10-01T22:27:50.583Z",
  "searchQuery": "GLAMOR Advanced Image Effects",
  "matchConfidence": 1
}