{
  "assetId": "276010",
  "title": "Infinite Lands: Node-Based Procedural World Generator",
  "slug": "infinite-lands-node-based-procedural-world-generator",
  "shortDescription": "Easy, optimized, customizable, and intuitive Node-Based Procedural Generation package",
  "description": "Easy, optimized, customizable, and intuitive Node-Based Procedural Generation package. To simplify the generation of worlds down to a couple of clicks while having full control with a hundred.This package will provide the tools necessary to build an optimized, infinite, procedural world at runtime. It makes use of Jobs and the Burst Compiler, and through a simple Node Editor, you will be able to generate the different meshes of the terrain, place points and prefabs into the ground, while also providing an optimized Vegetation Placer that uses GPU instancing to stay light-weight in all situationsIt is fully customizable to one needs while staying extremely simple and intuitive. An all-in-one package. The provided documentation has all the information needed, and otherwise, feel free to join our discord server to ask for help.Documentation | Direct SupportSimple and easy-to-use procedural generated terrain. Drop an Infinite Lands Terrain to generate from a single chunk of data, to a whole infinite world!Some of the core features:Seamless, Runtime generation of Infinite Worlds: Infinite runtime generation of terrain, vegetation, points of interest in terrains over 1.000.000km², updated in real-time and optimized to only do what it needs, when it needs it. Thanks to a Quad-Tree generation structure, it's blazing fast! No loading screens, no visible borders, just one continuous, immersive terrain.Create Worlds with Ease: Thanks to an Intuitive Graph Editor, you will be able to generate vast and interesting landscapes with just a few clicks. Start Your Game with Pre-Defined Samples: Experiment with ready-to-use sample scenes included in the package. Use them as inspiration or a foundation for your own unique worlds.Bake Terrains to use Externally: Bake terrain data into textures and export them to use in Blender, Houdini, or other tools. You can also store them as Unity Terrain Data and tweak them as you see fit.Your Style, Your Workflow: Infinite Lands adapts to you, not the other way around. Its component-based post-processing system ensures you can use your own assets, workflows, and artistic vision without losing any core features. Are you missing something? Just let me know so we can get it working. Procedural Asset Placement: Altought manual placement of objects is supported, Infinite Lands thrieves in the procedural landscape. The same graph to generate terrain allows you to place any amount of assets following yout defines rulesets. Comprehensive Documentation: Stay up to date with constantly evolving documentation, making your workflow smooth and frustration-free.One asset to rule them all! No need to buy other packages for terrain! You need texturing? Included. You need vegetation? Included. You need Points or Prefabs? Included. You need something else? Let me know, it's so simple to tweak that you yourself can add it, or otherwise it will be on the next update!Reliable Developer Support: Have questions? Join our Discord community and get quick, direct support from the developer.Quick feature list:Powerful Node EditorLive Terrain EditingDiverse Node LibraryStep-by-Step visualizationBiomes SupportExport to ImagesIntuitive workflowOptimized mesh generation with Jobs and Burst CompilerQuadtree and Grid-like infinite terrain generationAutomatic LOD CreationSupport for Decimated MeshSupport for Unity TerrainFloating Point OriginProcedural terrain shader with Stochastic Sampling, Triplanar Mapping, and distance resampling.Support for Object and Prefab PlacementIntegrated Vegetation SystemGPU Instanced assetsVegetation interactionColor and Normal blending with terrainDynamic Colliders supportBasic Wind SystemImpostor supportOcclusion, Frustum culling and more optimization techniquesMultiple Samples for Built-in, URP and HDRPContinuous UpdatesWhy Infinite Lands?Made by someone who likes to iterate quickly and therefore it's optimized and simplified for daily use. It's an all-in-package, you buy this and you will never need to buy another asset. There are no extra modules, all future updates will come for free in this one package.CompatibiltyIs this asset compatible with \"X\" asset? Head out to our compatibility page to learn more aobut it!It supports:Built-in, URP, HDRP and SRP in generalUnity 2021.3 and above, Unity 6.Custom assetsDependanciesTo use this asset, you will need:com.unity.burst: \"1.8.11\",com.unity.collections: \"1.4.0\",com.unity.render-pipelines.core:\"12.1.15\",com.unity.searcher: \"4.9.2\",com.unity.shadergraph: \"12.1.15\"Important NotesNot Yet Optimized for Mobile – The vegetation system relies heavily on compute shaders, which may not perform well on mobile devices. However, this can be replaced with a custom solution if needed.Ongoing Development – As Infinite Lands evolves, some updates may affect existing node graphs. If any breaking changes occur, we’ll notify you via our Discord server with solutions and updates.",
  "price": 79.98,
  "points": 200,
  "compareAtPrice": null,
  "available": "N/A",
  "rating": 5,
  "thumbnail": "https://assetstorev1-prd-cdn.unity3d.com/key-image/db06ca63-7bd6-4e35-830e-418a4ecd9fd1.jpg",
  "category": "terrain",
  "publisher": {
    "name": "Sapra",
    "url": "https://assetstore.unity.com/publishers/94890",
    "slug": "sapra"
  },
  "productUrl": "https://assetstore.unity.com/packages/package/276010",
  "sourceFile": "Infinite Lands Node-Based Procedural World Generator.unitypackage",
  "status": "draft",
  "visibility": "public",
  "createdAt": "2025-10-01T17:50:21.249Z",
  "updatedAt": "2025-10-01T22:27:50.811Z",
  "searchQuery": "Infinite Lands Node Based Procedural World Generator",
  "matchConfidence": 1
}